Revit 2027 API
PlasticVinyl.PlasticvinylPatternMap Property
 The property labeled "Image" from the "PlasticVinyl" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string PlasticvinylPatternMap { get; }
Public Shared ReadOnly Property PlasticvinylPatternMap As String
	Get
public:
static property String^ PlasticvinylPatternMap {
	String^ get ();
}
static member PlasticvinylPatternMap : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
See Also
Reference
PlasticVinyl Class
Autodesk.Revit.DB.Visual Namespace